
&НаКлиенте
Процедура ОткрытьСписокЗаявок(Команда)
	
	Форма = ПолучитьФорму("Документ.Заявки.ФормаСписка");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗакрытияЗаявок(Команда)
	
	Форма = ПолучитьФорму("Документ.ЗакрытиеЗаявок.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуДолги(Команда)
		
	Форма = ПолучитьФорму("Обработка.обДолги.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуЗаработок(Команда)
	
	Форма = ПолучитьФорму("Обработка.обЗаработок.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуВыполненныеРаботы(Команда)
	
	Форма = ПолучитьФорму("Обработка.обВыполненныеРаботы.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммуДолговНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаявкиОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Заявки.Остатки КАК ЗаявкиОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		СуммаДолга = ВыборкаДетальныеЗаписи.СуммаОстаток	
	Иначе		
		СуммаДолга = 0;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуДолгов(Команда)
	
	ОбновитьСуммуДолговНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСуммуДолговНаСервере();
	ТекущаяДатаПриОткрытии = НачалоМесяца(ТекущаяДата()); //Всегда должна быть началом месяца
	СформироватьПредставлениеДаты();
	ПолучитьДанныеДоходаРасхода();
	
КонецПроцедуры

Процедура СформироватьПредставлениеДаты()
	
	ПредставлениеДаты = Формат(ТекущаяДатаПриОткрытии,"ДФ='MMMM yyyy'" );
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДоходы(Команда)
	
	Форма = ПолучитьФорму("Документ.ПоступлениеДенег.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокРасходы(Команда)
	
	Форма = ПолучитьФорму("Документ.РасходДенег.ФормаСписка");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтатьиРасходов(Команда)
	
	Форма = ПолучитьФорму("Справочник.СтатьиРасходов.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыДоходов(Команда)
	
	Форма = ПолучитьФорму("Справочник.ВидыДоходов.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДоходыРасходы(Команда)
	
	Форма = ПолучитьФорму("Обработка.обДоходыРасходы.Форма.Форма");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМесяцКДате(Команда)
	
	ТекущаяДатаПриОткрытии = КонецМесяца(ТекущаяДатаПриОткрытии) + 1;
	ТекущаяДатаПриОткрытии = НачалоМесяца(ТекущаяДатаПриОткрытии);
	СформироватьПредставлениеДаты();
	ПолучитьДанныеДоходаРасхода();
	
КонецПроцедуры

&НаКлиенте
Процедура УбавитьМесяцИзДаты(Команда)
	
	ТекущаяДатаПриОткрытии = НачалоМесяца(ТекущаяДатаПриОткрытии) - 1;
	ТекущаяДатаПриОткрытии = НачалоМесяца(ТекущаяДатаПриОткрытии);
	СформироватьПредставлениеДаты();
	ПолучитьДанныеДоходаРасхода();
	
КонецПроцедуры

Процедура ПолучитьДанныеДоходаРасхода()
	
	
	
КонецПроцедуры



