
&НаКлиенте
Процедура ОткрытьСписокЗаявок(Команда)
	
	Форма = ПолучитьФорму("Документ.Заявки.ФормаСписка");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗакрытияЗаявок(Команда)
	
	Форма = ПолучитьФорму("Документ.ЗакрытиеЗаявок.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуДолги(Команда)
		
	Форма = ПолучитьФорму("Обработка.обДолги.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуЗаработок(Команда)
	
	Форма = ПолучитьФорму("Обработка.обЗаработок.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуВыполненныеРаботы(Команда)
	
	Форма = ПолучитьФорму("Обработка.обВыполненныеРаботы.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммуДолговНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаявкиОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Заявки.Остатки КАК ЗаявкиОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		СуммаДолга = ВыборкаДетальныеЗаписи.СуммаОстаток	
	Иначе		
		СуммаДолга = 0;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуДолгов(Команда)
	
	ОбновитьСуммуДолговНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСуммуДолговНаСервере();
	
КонецПроцедуры



