
&НаКлиенте
Процедура ОткрытьСписокЗаявок(Команда)
	
	Форма=ПолучитьФорму("Документ.Заявки.ФормаСписка");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗакрытияЗаявок(Команда)
	
	Форма=ПолучитьФорму("Документ.ЗакрытиеЗаявок.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуДолги(Команда)
		
	Форма=ПолучитьФорму("Обработка.обДолги.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуЗаработок(Команда)
	
	Форма=ПолучитьФорму("Обработка.обЗаработок.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуВыполненныеРаботы(Команда)
	
	Форма=ПолучитьФорму("Обработка.обВыполненныеРаботы.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммуДолговНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаявкиОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Заявки.Остатки КАК ЗаявкиОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		СуммаДолга = ВыборкаДетальныеЗаписи.СуммаОстаток	
	Иначе		
		СуммаДолга = 0;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуДолгов(Команда)
	ОбновитьСуммуДолговНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСуммуДолговНаСервере();
	ОбновитьДанныеПоАвтоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоАвтоНаСервере()
	
	АвтоПоУмолчанию = АвтоВызовСервера.ПолучитьАвтоПоУмолчанию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПробегАвтоСрезПоследних.Период КАК Период,
		|	ПробегАвтоСрезПоследних.Авто КАК Авто,
		|	ПробегАвтоСрезПоследних.Пробег КАК Пробег
		|ИЗ
		|	РегистрСведений.ПробегАвто.СрезПоследних КАК ПробегАвтоСрезПоследних
		|ГДЕ
		|	ПробегАвтоСрезПоследних.Авто = &АвтоПоУмолчанию";
	
	Запрос.УстановитьПараметр("АвтоПоУмолчанию", АвтоПоУмолчанию);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ПробегДата 	= ВыборкаДетальныеЗаписи.Период;
		Пробег 		= ВыборкаДетальныеЗаписи.Пробег;
	Иначе
		
	КонецЕсли;
	
	 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПробег(Команда)
	ОбновитьДанныеПоАвтоНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	Константы.АвтоПоУмолчанию.Установить(АвтоПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры



