
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСуммуДолговНаСервере();
	ТекущаяДатаПриОткрытии = НачалоМесяца(ТекущаяДата()); //Всегда должна быть началом месяца
	СформироватьПредставлениеДаты();
	ПолучитьДанныеДоходаРасхода();
	
КонецПроцедуры

#Область ПроцедурыОткрытияФорм

&НаКлиенте
Процедура ОткрытьСписокЗаявок(Команда)
	
	Форма = ПолучитьФорму("Документ.Заявки.ФормаСписка");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗакрытияЗаявок(Команда)
	
	Форма = ПолучитьФорму("Документ.ЗакрытиеЗаявок.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуДолги(Команда)
		
	Форма = ПолучитьФорму("Обработка.обДолги.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуЗаработок(Команда)
	
	Форма = ПолучитьФорму("Обработка.обЗаработок.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуВыполненныеРаботы(Команда)
	
	Форма = ПолучитьФорму("Обработка.обВыполненныеРаботы.Форма");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДоходы(Команда)
	
	Форма = ПолучитьФорму("Документ.ПоступлениеДенег.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокРасходы(Команда)
	
	Форма = ПолучитьФорму("Документ.РасходДенег.ФормаСписка");
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтатьиРасходов(Команда)
	
	Форма = ПолучитьФорму("Справочник.СтатьиРасходов.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВидыДоходов(Команда)
	
	Форма = ПолучитьФорму("Справочник.ВидыДоходов.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДоходыРасходы(Команда)
	
	Форма = ПолучитьФорму("Обработка.обДоходыРасходы.Форма.Форма");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрРегулярныеРасходы(Команда)
	
	Форма = ПолучитьФорму("РегистрСведений.РегулярныеРасходы.Форма.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникРегулярныеРасходы(Команда)
	
	Форма = ПолучитьФорму("Справочник.РегулярныйРасход.ФормаСписка");
	Форма.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область РазделЗаработок

&НаСервере
Процедура ОбновитьСуммуДолговНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаявкиОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Заявки.Остатки КАК ЗаявкиОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		СуммаДолга = ВыборкаДетальныеЗаписи.СуммаОстаток	
	Иначе		
		СуммаДолга = 0;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуДолгов(Команда)
	
	ОбновитьСуммуДолговНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область РазделДоходыРасходы

&НаСервере
Процедура СформироватьПредставлениеДаты()
	
	ПредставлениеДаты = Формат(ТекущаяДатаПриОткрытии,"ДФ='MMMM yyyy'" );
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМесяцКДате(Команда)
	
	ТекущаяДатаПриОткрытии = КонецМесяца(ТекущаяДатаПриОткрытии) + 1;
	ТекущаяДатаПриОткрытии = НачалоМесяца(ТекущаяДатаПриОткрытии);
	СформироватьПредставлениеДаты();
	ПолучитьДанныеДоходаРасхода();
	
КонецПроцедуры

&НаКлиенте
Процедура УбавитьМесяцИзДаты(Команда)
	
	ТекущаяДатаПриОткрытии = НачалоМесяца(ТекущаяДатаПриОткрытии) - 1;
	ТекущаяДатаПриОткрытии = НачалоМесяца(ТекущаяДатаПриОткрытии);
	СформироватьПредставлениеДаты();
	ПолучитьДанныеДоходаРасхода();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеДоходаРасхода()
	
	//Доходы
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступленияДенегОбороты.СуммаДоходаОборот КАК СуммаДоходаОборот
		|ИЗ
		|	РегистрНакопления.ПоступленияДенег.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПоступленияДенегОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДатаПриОткрытии));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(ТекущаяДатаПриОткрытии));	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		СуммаДоходов = ВыборкаДетальныеЗаписи.СуммаДоходаОборот;
	Иначе
		СуммаДоходов = 0;	
	КонецЕсли;
	
	//Расходы
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходДенегОбороты.СуммаРасходаОборот КАК СуммаРасходаОборот
		|ИЗ
		|	РегистрНакопления.РасходДенег.Обороты(&НачалоПериода, &КонецПериода, , ) КАК РасходДенегОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДатаПриОткрытии));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(ТекущаяДатаПриОткрытии));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		СуммаРасходов = ВыборкаДетальныеЗаписи.СуммаРасходаОборот;
	Иначе
		СуммаРасходов = 0;	
	КонецЕсли;
	
	//Планируемые расходы
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РегулярныеРасходы.СуммаРасхода) КАК СуммаРасхода
		|ИЗ
		|	РегистрСведений.РегулярныеРасходы КАК РегулярныеРасходы
		|ГДЕ
		|	НЕ РегулярныеРасходы.РегулулярныйРасход В
		|				(ВЫБРАТЬ
		|					РасходДенегОбороты.РегулярныйРасход КАК РегулярныйРасход
		|				ИЗ
		|					РегистрНакопления.РасходДенег.Обороты(&НачалоПериода, &КонецПериода, , ) КАК РасходДенегОбороты)";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДатаПриОткрытии));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(ТекущаяДатаПриОткрытии));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		НеУчтенныйРасход = ВыборкаДетальныеЗаписи.СуммаРасхода;	
	Иначе
		НеУчтенныйРасход = 0	
	КонецЕсли;
	
	//Разность доход расход
	РазностьДоходРасход = СуммаДоходов - СуммаРасходов;
	//ПроцентРасхода
	
КонецПроцедуры

#КонецОбласти



