
&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()

	Объект.ЗаявкиДляЗакрытия.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкиОстатки.Заказчик КАК Заказчик,
		|	ЗаявкиОстатки.Заявка КАК Заявка,
		|	ЗаявкиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Заявки.Остатки(, Заказчик = &Заказчик) КАК ЗаявкиОстатки";
	
	Запрос.УстановитьПараметр("Заказчик", Объект.Заказчик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.ЗаявкиДляЗакрытия.Добавить();
		НовСтр.Заявка = ВыборкаДетальныеЗаписи.Заявка;
		НовСтр.ВыполненнаяРабота = "";
		НовСтр.ЗакрытаяСумма = ВыборкаДетальныеЗаписи.СуммаОстаток;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры


