
&НаСервере
Процедура СформироватьНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");	
	
	Макет = Обработка.ПолучитьМакет("Макет");
	
	ТабличныйДокумент = ТабДок;
	ТабличныйДокумент.Очистить();
	
	облЗаголовок 	= Макет.ПолучитьОбласть("облЗаголовок");
	облШапка 		= Макет.ПолучитьОбласть("облШапка");
	облСтрока 		= Макет.ПолучитьОбласть("ОблСтрока");
	облИтого 		= Макет.ПолучитьОбласть("облИтого");

	ТабличныйДокумент.Вывести(облЗаголовок);
	ТабличныйДокумент.Вывести(облШапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЛотереи", ?(ЗначениеЗаполнено(Лотерея),Лотерея,Неопределено));
	Запрос.УстановитьПараметр("КонецПериода", ?(ЗначениеЗаполнено(КонецПериода),КонецПериода,Дата(2999,12,31,23,59,59)));
	Запрос.УстановитьПараметр("НачалоПериода", ?(ЗначениеЗаполнено(НачалоПериода),НачалоПериода,Дата(1,1,1,0,0,0)));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛотереяОстаткиИОбороты.ВидЛотереи КАК Лотерея,
		|	ЛотереяОстаткиИОбороты.СуммаНачальныйОстаток КАК НаНачало,
		|	ЛотереяОстаткиИОбороты.СуммаПриход КАК Заработал,
		|	ЛотереяОстаткиИОбороты.СуммаРасход КАК Купил,
		|	ЛотереяОстаткиИОбороты.СуммаКонечныйОстаток КАК НаКонец
		|ИЗ
		|	РегистрНакопления.Лотерея.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			,
		|			ВЫБОР
		|				КОГДА &ВидЛотереи = НЕОПРЕДЕЛЕНО
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ВидЛотереи = &ВидЛотереи
		|			КОНЕЦ) КАК ЛотереяОстаткиИОбороты
		|ИТОГИ
		|	СУММА(НаНачало),
		|	СУММА(Заработал),
		|	СУММА(Купил),
		|	СУММА(НаКонец)
		|ПО
		|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	облИтого.Параметры.НаНачало = ВыборкаОбщийИтог.НаНачало;
	облИтого.Параметры.Заработал = ВыборкаОбщийИтог.Заработал;
	облИтого.Параметры.Купил = ВыборкаОбщийИтог.Купил;
	облИтого.Параметры.НаКонец = ВыборкаОбщийИтог.НаКонец;
	ТабличныйДокумент.Вывести(облИтого);
	
	ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		облСтрока.Параметры.Лотерея = ВыборкаДетальныеЗаписи.Лотерея;
		облСтрока.Параметры.НаНачало = ВыборкаДетальныеЗаписи.НаНачало;
		облСтрока.Параметры.Заработал = ВыборкаДетальныеЗаписи.Заработал;
		облСтрока.Параметры.Купил = ВыборкаДетальныеЗаписи.Купил;
		облСтрока.Параметры.НаКонец = ВыборкаДетальныеЗаписи.НаКонец;
		ТабличныйДокумент.Вывести(облСтрока);
	КонецЦикла;
	
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЛотереяОстатки.ВидЛотереи КАК ВидЛотереи,
	//	|	ЛотереяОстатки.СуммаОстаток КАК СуммаОстаток
	//	|ИЗ
	//	|	РегистрНакопления.Лотерея.Остатки(, ) КАК ЛотереяОстатки
	//	|ИТОГИ
	//	|	СУММА(СуммаОстаток)
	//	|ПО
	//	|	ОБЩИЕ";
	//
	//РезультатЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//
	//Пока РезультатЗапроса.Следующий() цикл
	//	облИтого.Параметры.Сумма = РезультатЗапроса.СуммаОстаток;
	//	
	//	ВыборкаВидЛотереи = РезультатЗапроса.Выбрать();	
	//	Пока ВыборкаВидЛотереи.Следующий() Цикл
	//		облСтрока.Параметры.Лот = ВыборкаВидЛотереи.ВидЛотереи;
	//		облСтрока.Параметры.Сумма = ВыборкаВидЛотереи.СуммаОстаток;
	//		ТабличныйДокумент.Вывести(облСтрока);
	//	КонецЦикла;
	//	ТабДок.Вывести(облИтого);
	//КонецЦикла;

	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
