
Функция ПолучитьДатуЗапрета() Экспорт
	
	Возврат Константы.ДатаЗапретаИЗменения.Получить();
	
КонецФункции	
	
Процедура ПроверкаНаДатуЗапретаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ДатаЗапрета = ПолучитьДатуЗапрета();
	
	Если ДатаЗапрета > Источник.Дата тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекущегоПользователя() Экспорт
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

Процедура УстановкаАвтораДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.Автор) тогда
		Источник.Автор = ПолучитьТекущегоПользователя();
	КонецЕсли;		
	
КонецПроцедуры


