
Процедура ОбработкаПроведения(Отказ, Режим)

	Для каждого стр из ЗаявкиДляЗакрытия цикл
		// регистр Заявки Расход
		Движения.Заявки.Записывать = Истина;
		Движение = Движения.Заявки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период 	 = Дата;
		Движение.Заказчик 	 = Заказчик;
		Движение.Заявка 	 = стр.Заявка;
		Движение.Сумма 		 = стр.ЗакрытаяСумма;		
		
		// регистр Заработок 
		Движения.Заработок.Записывать = Истина;
		Движение = Движения.Заработок.Добавить();
		Движение.Период 	= Дата;
		Движение.Заказчик   = Заказчик;
		Движение.Сумма 		= стр.ЗакрытаяСумма;		
	КонецЦикла;
	
	// регистр Поступления денег 
	Движения.ПоступленияДенег.Записывать = Истина;
	Движение = Движения.ПоступленияДенег.Добавить();
	Движение.Период 	 = Дата;
	Движение.ВидДоходов  = Справочники.ВидыДоходов.ДополнительныйЗаработок;
	Движение.СуммаДохода = ЗаявкиДляЗакрытия.Итог("ЗакрытаяСумма");

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ОбменДанными.Загрузка тогда
		СуммаИтого = ЗаявкиДляЗакрытия.Итог("ЗакрытаяСумма");		
	КонецЕсли;
	
КонецПроцедуры
