
Процедура ОбработкаПроведения(Отказ, Режим)

	Для каждого стр из ЗаявкиДляЗакрытия цикл
		// регистр Заявки Расход
		Движения.Заявки.Записывать = Истина;
		Движение = Движения.Заявки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Заказчик = Заказчик;
		Движение.Заявка = стр.Заявка;
		Движение.Сумма = стр.ЗакрытаяСумма;
		
		
		// регистр Заработок 
		Движения.Заработок.Записывать = Истина;
		Движение = Движения.Заработок.Добавить();
		Движение.Период = Дата;
		Движение.Заказчик = Заказчик;
		Движение.Сумма = стр.ЗакрытаяСумма;
	КонецЦикла;
	
КонецПроцедуры
