#Если МобильныйАвтономныйСервер тогда
	
Процедура ВыполнитьОбменДанными() Экспорт

	НаименованиеУстройства = Константы.НаименованиеУстройства.Получить();
	
	Если НаименованиеУстройства = "" тогда
		Возврат;
	КонецЕсли;
	
	ЦентральныйУзелОбмена = ПланыОбмена.ОбменСАвтономнымСервером.НайтиПоКоду("001");
    Если ЦентральныйУзелОбмена.Пустая() Тогда
        
        НовыйУзел = ПланыОбмена.Мобильные.СоздатьУзел();
    	НовыйУзел.Код = "001";
    	НовыйУзел.Наименование = "Центральный";
    	НовыйУзел.Записать();
        ЦентральныйУзелОбмена = НовыйУзел.Ссылка;
        
    КонецЕсли;
    
	Узел = ПланыОбмена.ОбменСАвтономнымСервером.ЭтотУзел();
    // Инициализируем обмен, проверяем, есть ли нужный узел в плане обмена.
	НовыйКод = ОсновнойСервер.ОбменМобильныйВызовПК.НачатьОбмен(Узел.Код, НаименованиеУстройства, ЦентральныйУзелОбмена.НомерПринятого, ЦентральныйУзелОбмена.НомерОтправленного);
	
    Если Узел.Код <> НовыйКод Тогда
        
		ОбъектУзла = Узел.ПолучитьОбъект();
		ОбъектУзла.Код = НовыйКод;
        ОбъектУзла.Наименование = НаименованиеУстройства;
		ОбъектУзла.Записать();
        
    КонецЕсли;
    
    // Отправляем данные
    ДанныеОбмена = ОбменМобильныеОбщее.СформироватьПакетОбмена(ЦентральныйУзелОбмена);
	ДанныеОбмена = ОсновнойСервер.ОбменМобильныйВызовПК.ВыполнитьОбменДанными(ЦентральныйУзелОбмена, ДанныеОбмена);
	
	
    // Принимаем данные
	//ДанныеОбмена = Прокси.ПолучитьДанные(Узел.Код);
	//Константы.НовыеЗаказы.Установить(0);
	//ОбменМобильныеОбщее.ПринятьПакетОбмена(ЦентральныйУзелОбмена, ДанныеОбмена);

КонецПроцедуры	
	
#КонецЕсли