
&НаСервере
Процедура ПерепровестиВсеДокументыНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявки.Ссылка КАК Ссылка,
		|	Заявки.Дата КАК Дата
		|ИЗ
		|	Документ.Заявки КАК Заявки
		|ГДЕ
		|	Заявки.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗакрытиеЗаявок.Ссылка,
		|	ЗакрытиеЗаявок.Дата
		|ИЗ
		|	Документ.ЗакрытиеЗаявок КАК ЗакрытиеЗаявок
		|ГДЕ
		|	ЗакрытиеЗаявок.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеДенег.Ссылка,
		|	ПоступлениеДенег.Дата
		|ИЗ
		|	Документ.ПоступлениеДенег КАК ПоступлениеДенег
		|ГДЕ
		|	ПоступлениеДенег.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходДенег.Ссылка,
		|	РасходДенег.Дата
		|ИЗ
		|	Документ.РасходДенег КАК РасходДенег
		|ГДЕ
		|	РасходДенег.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерепровестиВсеДокументы(Команда)
	ПерепровестиВсеДокументыНаСервере();
КонецПроцедуры
