
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() тогда	
		ЭтаФорма.ТолькоПросмотр = ОбщегоНазначенияСервер.ПолучитьДатуЗапрета() > Объект.Дата;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РегулярныйРасходПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Объект.РегулярныйРасход) тогда
		Объект.СтатьяРасходов = Объект.РегулярныйРасход.СтатьяРасходов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегулярныйРасходПриИзменении(Элемент)
	РегулярныйРасходПриИзмененииНаСервере();
КонецПроцедуры


