
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ТекПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	ТекПользователь = Справочники.Пользователи.НайтиПоКоду(ТекПользовательИБ.Имя);
	
	Если ТекПользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
		НовПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовПользователь.Наименование = ТекПользовательИБ.ПолноеИмя;
		НовПользователь.Код = ТекПользовательИБ.Имя;
		НовПользователь.Записать();
		
		ТекПользователь	= НовПользователь.Ссылка;
	КонецЕсли; 
	
	ПараметрыСеанса.ТекущийПользователь = ТекПользователь;
КонецПроцедуры
